Дневник_Инвестора/src/Documents/ТранзакционныеИздержки/ТранзакционныеИздержки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТранзакционныеИздержки</name>
  <attributes>
    <name>БиржаОтправитель</name>
    <type>
      <types>CatalogRef.Биржи</types>
    </type>
  </attributes>
  <attributes>
    <name>БиржаПолучатель</name>
    <type>
      <types>CatalogRef.Биржи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.СетиБлокчейн</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комиссии</name>
    <attributes>
      <name>Криптовалюта</name>
      <type>
        <types>CatalogRef.Криптовалюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипКомиссии</name>
      <type>
        <types>EnumRef.ТипыКомиссии</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКомиссии</name>
      <type>
        <types>DefinedType.СуммаПоложительная</types>
      </type>
    </attributes>
    <attributes>
      <name>КурсUSDT</name>
      <type>
        <types>DefinedType.СуммаПоложительная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВРублях</name>
      <type>
        <types>DefinedType.СуммаПоложительная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дневник_Инвестора/src/Documents/ТранзакционныеИздержки/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомиссии

&НаКлиенте
Процедура КомиссииСуммаКомиссииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Комиссии.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.КурсUSDT = КурсВалютыUSD(Объект.Дата);
	ТекущиеДанные.СуммаВРублях = ТекущиеДанные.КурсUSDT * ТекущиеДанные.СуммаКомиссии;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервереБезКонтекста
Функция КурсВалютыUSD(ДатаКурса)
	
	ДолларСША = Справочники.Валюты.ВалютаUSD(); //TODO реализовать метод
	
	Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(
		ДолларСША, ?(ЗначениеЗаполнено(ДатаКурса), ДатаКурса, ТекущаяДатаСеанса()));
	
КонецФункции

#КонецОбласти
